import newsImg from "../../assets/news.jpg";

const news = [
  {
    id: 11,
    title:
      "২০২০-২০২১ শিক্ষাবর্ষে মেডিকেল ভর্তি পরীক্ষায় সারা বাংলাদেশে মেধা তালিকায় দ্বিতীয় স্থান অধিকার করেছে আমাদের শিক্ষার্থী মোঃ তানভীন আহমেদ ।",
    desc: "২০২০-২০২১ শিক্ষাবর্ষে মেডিকেল ভর্তি পরীক্ষায় দ্বিতীয় স্থান অধিকার করেছে অত্র কলেজের শিক্ষার্থী মোঃ তানভীন আহমেদ (এসএসসি ব্যাচ- ২০১৮ ও এইচএসসি ব্যাচ ২০২০) তার এই অর্জন আমদের জন্য গর্বের।",
    img: newsImg,
  },
  {
    id: 131,
    title:
      "২০২০-২০২১ শিক্ষাবর্ষে মেডিকেল ভর্তি পরীক্ষায় সারা বাংলাদেশে মেধা তালিকায় দ্বিতীয় স্থান অধিকার করেছে আমাদের শিক্ষার্থী মোঃ তানভীন আহমেদ ।",
    desc: "২০২০-২০২১ শিক্ষাবর্ষে মেডিকেল ভর্তি পরীক্ষায় দ্বিতীয় স্থান অধিকার করেছে অত্র কলেজের শিক্ষার্থী মোঃ তানভীন আহমেদ (এসএসসি ব্যাচ- ২০১৮ ও এইচএসসি ব্যাচ ২০২০) তার এই অর্জন আমদের জন্য গর্বের।",
    img: newsImg,
  },
  {
    id: 141,
    title:
      "২০২০-২০২১ শিক্ষাবর্ষে মেডিকেল ভর্তি পরীক্ষায় সারা বাংলাদেশে মেধা তালিকায় দ্বিতীয় স্থান অধিকার করেছে আমাদের শিক্ষার্থী মোঃ তানভীন আহমেদ ।",
    desc: "২০২০-২০২১ শিক্ষাবর্ষে মেডিকেল ভর্তি পরীক্ষায় দ্বিতীয় স্থান অধিকার করেছে অত্র কলেজের শিক্ষার্থী মোঃ তানভীন আহমেদ (এসএসসি ব্যাচ- ২০১৮ ও এইচএসসি ব্যাচ ২০২০) তার এই অর্জন আমদের জন্য গর্বের।",
    img: newsImg,
  },
];
const LastNews = () => {
  return (
    <div className=" mb-6 border-4 border-primary-20/70 rounded-md">
      <h1 className="text-center text-xl sm:text-2xl font-bold bg-primary-20/70 p-2 text-white">
        সর্বশেষ সংবাদ
      </h1>
      {news.map((item) => (
        <div
          key={item.id}
          className="bg-green-500/10 p-4  shadow-primary-10/20  odd:bg-teal-500/20"
        >
          <h1 className="text-lg font-semibold text-primary-20 mb-3">
            {item.title}
          </h1>
          <div className="flex gap-2 items-center">
            <img src={item.img} alt="" />
            <p className="text-zinc-700">{item.desc}</p>
          </div>
        </div>
      ))}
    </div>
  );
};

export default LastNews;
